app/controllers/cabins_controller.rb

SELECT "cabins".* FROM "cabins"
---
  def index
    @cabins = Cabin.all