app/controllers/cabin_reservations_controller.rb

  def index
    @cabin_reservations = CabinReservation.all
---
SELECT "cabin_reservations".* FROM "cabin_reservations"