app/controllers/campings_controller.rb

SELECT "campings".* FROM "campings"
---
  def index
    @campings = Camping.all