app/controllers/previews_controller.rb

SELECT "previews".* FROM "previews"
---
  def index
    @previews = Preview.all

INSERT INTO "previews" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-11-16 21:51:17.398451"], ["updated_at", "2021-11-16 21:51:17.398451"]]
---
  def create
    @preview = Preview.new(preview_params)

    respond_to do |format|
      if @preview.save

DELETE FROM "previews" WHERE "previews"."id" = ?  [["id", 1]]
---
  def destroy
    @preview.destroy

SELECT "previews".* FROM "previews" WHERE "previews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_preview
      @preview = Preview.find(params[:id])